
Dim $aM[1]
$z=0
$timer = TimerInit()
For $i = 1 to 1000
	ReDim $aM[$i]
	; $z+=1
Next
MsgBox(0,"Время выполнения ReDim", 'Массив aM= '&UBound($aM) &@CRLF&'z= '&$z&@CRLF&Round(TimerDiff($timer) / 1000, 2) & ' сек')

; 1-1000 ReDim - 0.01 сек
; 1-10000 ReDim - 0.97 сек
; 99000-100000 ReDim - 1.92 сек (1000 ReDim при величине массива 100000 выполняется заметно дольше)
; 999980-1000000 ReDim - 0.41 сек  (20 ReDim при величине массива 1000000)

; 1-100 000 $z+=1 - 0.02 сек - тест примитивного цикла для проверки погрешности добавляемой самим циклом.
; 1-1000 000 $z+=1 - 0.23 сек