


#include <Array.au3>
; если декларированы (Global или Local), то измен€ютс€ функцией, если в ней не установлены как Local
Global $a[7][4], $var1=11, $var2=22, $var3=33
Local $var4=44, $var5=55, $var6=66
$a[0][0]=6
$a[0][1]='им€'
$a[0][2]='до'
$a[0][3]='после'
$a[1][0]='Local'
$a[2][0]='Dim'
$a[3][0]='ничего'
$a[4][0]='Local'
$a[5][0]='Dim'
$a[6][0]='ничего'


For $i = 1 to $a[0][0]
	$a[$i][1]='var'&$i ; им€ переменной
	$a[$i][2]=Eval('var' & $i) ; значение переменной в начале
Next

_Test1()

For $i = 1 to $a[0][0]
	$a[$i][3]=Eval('var' & $i) ; значение переменной в после
Next


_ArrayDisplay($a, 'Array')
If Not IsDeclared('var7') Then MsgBox(0, '—ообщение', 'ѕеременна€ var7 не декларирована')

Func _Test1()
	Local $var1='ага1'
	Dim $var2='ага2'
	$var3='ага3'
	Local $var4='ага4'
	Dim $var5='ага5'
	$var6='ага6'
	$var7='ага7' ; если не декларирована в скрипте, то уничтожаетс€ при звершении функции, как локальна€
EndFunc



